
## Plan Result

[CI link](https://github.com/soat-tech-challenge/terraform-aws-rds/actions/runs/6741952471)


<pre><code>Plan: 4 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_db_instance.soat_tc_rds_db
  * aws_db_parameter_group.soat_tc_rds_parameter_group
  * aws_db_subnet_group.soat_tc_rds_subnet_group
  * aws_security_group.soat_tc_rds_sg


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_db_instance.soat_tc_rds_db will be created
  + resource "aws_db_instance" "soat_tc_rds_db" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = (known after apply)
      + db_subnet_group_name                  = "soat-tc-rds-subnet-group"
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_version                        = "15.3"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "soat-tc-rds-db"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + name                                  = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = "soat-tc-rds-parameter-group"
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = 5432
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_throughput                    = (known after apply)
      + storage_type                          = "gp2"
      + tags_all                              = {
          + "Project"    = "soat-tech-challenge"
          + "Repository" = "soat-tech-challenge/terraform-aws-rds"
        }
      + timezone                              = (known after apply)
      + username                              = "postgres"
      + vpc_security_group_ids                = (known after apply)
    }

  # aws_db_parameter_group.soat_tc_rds_parameter_group will be created
  + resource "aws_db_parameter_group" "soat_tc_rds_parameter_group" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + family      = "postgres15"
      + id          = (known after apply)
      + name        = "soat-tc-rds-parameter-group"
      + name_prefix = (known after apply)
      + tags_all    = {
          + "Project"    = "soat-tech-challenge"
          + "Repository" = "soat-tech-challenge/terraform-aws-rds"
        }

      + parameter {
          + apply_method = "immediate"
          + name         = "log_connections"
          + value        = "1"
        }
    }

  # aws_db_subnet_group.soat_tc_rds_subnet_group will be created
  + resource "aws_db_subnet_group" "soat_tc_rds_subnet_group" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "soat-tc-rds-subnet-group"
      + name_prefix             = (known after apply)
      + subnet_ids              = [
          + "subnet-05b363559bcd99de3",
          + "subnet-0b0fa34fc5f29a727",
        ]
      + supported_network_types = (known after apply)
      + tags_all                = {
          + "Project"    = "soat-tech-challenge"
          + "Repository" = "soat-tech-challenge/terraform-aws-rds"
        }
      + vpc_id                  = (known after apply)
    }

  # aws_security_group.soat_tc_rds_sg will be created
  + resource "aws_security_group" "soat_tc_rds_sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 5432
            },
        ]
      + name                   = "soat-tc-rds-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Project"    = "soat-tech-challenge"
          + "Repository" = "soat-tech-challenge/terraform-aws-rds"
        }
      + vpc_id                 = "vpc-021977318f78d058f"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + rds_instance_id = "soat-tc-rds-db"
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform_check","PRNumber":2,"Program":"tfcmt","SHA1":"8891f4f462f940e9964ae8a3e261596fe0557e7b","Vars":{},"WorkflowName":"Pull Request"} -->